Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_gptw.c
/**
 * @file rx_gptw.c
 * @brief GPTW PWM Driver Implementation for Motor Control
 *
 * @details
 * **Production-grade implementation** of the General PWM Timer (GPTW) driver for
 * RX72N motor control applications. This file contains all internal helper
 * functions and public API implementations for GPTW peripheral management.
 *
 * ## Module Architecture
 *
 * The implementation is structured in three layers:
 * 1. **Constants & Configuration**: Typed enums for all magic numbers
 * 2. **Internal Helpers**: Register access, calculations, hardware configuration
 * 3. **Public API**: User-facing functions documented in rx_gptw.h
 *
 * ## Supported PWM Modes
 *
 * **1. Sawtooth-wave PWM (edge-aligned)**:
 * - Counter: 0 -> GTPR -> 0 (reset at top)
 * - Period = PCLKA / frequency
 * - For 20kHz: period = 120MHz / 20kHz = 6000 counts (~12.5-bit resolution)
 * - Single update point at counter reset
 * - Best for: Simple PWM, LED dimming
 *
 * **2. Triangle-wave PWM (center-aligned)**:
 * - Counter: 0 -> GTPR -> 0 (up/down counting)
 * - Period = PCLKA / (2 x frequency)
 * - For 20kHz: period = 120MHz / 40kHz = 3000 counts (~11.5-bit resolution)
 * - Update at crest and/or trough (mode dependent)
 * - Lower EMI due to symmetric switching edges
 * - Reduced current ripple in motor windings
 * - Best for: Motor control with H-bridge
 *
 * ## Implementation Notes
 *
 * **Register Access Pattern**:
 * All GPTW register modifications follow this sequence:
 * 1. Unlock write protection (GTWP = 0xA500_0000)
 * 2. Modify registers
 * 3. Lock write protection (GTWP = 0x0000_0001)
 *
 * **Phase Staggering Implementation**:
 * For 4-motor systems, channels are initialized with counter offsets:
 * - Ch0: GTCNT = 0 (0deg reference)
 * - Ch1: GTCNT = period/4 (90deg offset)
 * - Ch2: GTCNT = period/2 (180deg offset)
 * - Ch3: GTCNT = 3xperiod/4 (270deg offset)
 *
 * ## Memory Map
 *
 * @par GPTW Register Base Addresses:
 *
 * | Module | Base Address | Size | Description |
 * |--------|--------------|------|-------------|
 * | GPTW Common | 0x000C2000 | 0x100 | Shared start/stop registers |
 * | GPTW0 | 0x000C2100 | 0x80 | Channel 0 registers |
 * | GPTW1 | 0x000C2180 | 0x80 | Channel 1 registers |
 * | GPTW2 | 0x000C2200 | 0x80 | Channel 2 registers |
 * | GPTW3 | 0x000C2280 | 0x80 | Channel 3 registers |
 *
 * @par Module Clock:
 * - MSTPCRC.MSTPC10 controls GPTW module clock
 * - Must be cleared (= 0) before register access
 * - Protected by PRCR register lock
 *
 * ## Static Variables
 *
 * | Variable | Type | Purpose |
 * |----------|------|---------|
 * | s_gptw_initialized[] | bool[4] | Track which channels are initialized |
 * | s_gptw_period[] | uint32_t[4] | Cache period values for duty calculation |
 * | s_tag | const char* | Log tag "GPTW" |
 *
 * @par NASA Power of 10 Compliance:
 *
 * | Rule | Status | Implementation |
 * |------|--------|----------------|
 * | 1. Simple control flow | [OK] | No goto/setjmp/recursion in any function |
 * | 2. Fixed loop bounds | [OK] | Loops bounded by k_gptw_max_channels (4) |
 * | 3. No dynamic allocation | [OK] | All variables static or stack, zero malloc |
 * | 4. Small functions | [OK] | All functions < 60 lines |
 * | 5. Assertions | [OK] | RX_CHECK_NULL_PTR, switch validation, range checks |
 * | 6. Narrow scope | [OK] | Internal functions use static, minimal globals |
 * | 7. Check return values | [OK] | All rx_err_t returns propagated or handled |
 * | 8. Limited preprocessor | [OK] | C23 typed enums, macros only for RX_CHECK |
 * | 9. Pointer restrictions | [OK] | Single-level pointers, no function pointers |
 * | 10. Compiler warnings | [OK] | Builds clean with -Wall -Wextra -Werror |
 *
 * @par SOLID Principles:
 *
 * **Single Responsibility**: This file handles ONLY GPTW hardware abstraction.
 * Motor control logic, PID calculations, and H-bridge configuration are in
 * separate modules.
 *
 * **Open/Closed**: New waveform modes can be added by extending the
 * rx_gptw_wave_mode_t enum and internal_get_gtcr_mode() without modifying
 * existing code paths.
 *
 * @see rx_gptw.h Public API documentation
 * @see rx72n_gptw_regs.h Register structure definitions
 * @see RX72N Hardware Manual Chapter 26 - General PWM Timer (GPTW)
 * @see docs/sections/03_hardware_pinout.tex Pin assignments
 *
 * @author Locked, Inc.
 * @date 2026-01-27
 * @copyright Copyright (c) 2026 Locked Inc.
 * SPDX-License-Identifier: MIT
 * @since Version 1.0.0
 */

#ifdef __RX__

#include "rx_gptw.h"

#include <stddef.h>

#include "rx72n_regs.h"
#include "rx_check.h"
#include "rx_log.h"
#include "rx_register_protection.h"

static const char* s_tag = "GPTW";

/* =============================================================================
 * Constants
 * =============================================================================
 */

/** @brief GPTW general constants */
typedef enum : uint8_t {
  k_gptw_max_channels        = 4, /**< GPTW0-GPTW3 */
  k_gptw_outputs_per_channel = 2, /**< GTIOCA and GTIOCB */
} gptw_constants_t;

/** @brief Period calculation constants */
static const uint32_t s_gptw_period_max    = 0xFFFFFFFFUL;  /**< Maximum valid period (32-bit) */
static const uint64_t s_gptw_ns_per_second = 1000000000ULL; /**< Nanoseconds per second */

typedef enum : uint16_t {
  k_gptw_period_divisor_saw = 1,  /**< Sawtooth: period = PCLKA / freq */
  k_gptw_period_divisor_tri = 2,  /**< Triangle: period = PCLKA / (2 * freq) */
  k_gptw_period_min         = 10, /**< Minimum valid period */
  k_gptw_period_zero        = 0,  /**< Zero period value */
  k_gptw_deadtime_disabled  = 0,  /**< No dead time */
} gptw_period_constants_t;

/** @brief Duty cycle calculation constants */
typedef enum : uint8_t {
  k_gptw_duty_min     = 0,   /**< Minimum duty cycle (0%) */
  k_gptw_duty_max     = 100, /**< Maximum duty cycle (100%) */
  k_gptw_duty_divisor = 100, /**< Divisor for percentage conversion */
} gptw_duty_constants_t;

/** @brief MPC configuration constants */
typedef enum : uint8_t {
  k_mpc_pwpr_b0wi_clear = 0x00, /**< Clear B0WI to enable PFSWE write */
  k_mpc_pwpr_pfswe_set  = 0x40, /**< Set PFSWE to enable PFS write */
  k_mpc_pwpr_lock       = 0x80, /**< Set B0WI to lock PFS */
} mpc_pwpr_constants_t;

