Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_gptw.c
/** @brief MPC PFS register offset constants */
typedef enum : uint16_t {
  k_mpc_pfs_base_offset = 0x40, /**< Base offset for PFS registers */
  k_mpc_port_e_index    = 0x0E, /**< Port E index */
  k_mpc_pfs_port_stride = 8,    /**< Bytes between port PFS groups */
} mpc_pfs_offset_constants_t;

/** @brief Single-bit value for shift operations */
typedef enum : uint8_t {
  k_gptw_bit_set = 1, /**< Value for single bit in shift operations */
} gptw_bit_constants_t;

/** @brief GPTW channel mask for start/stop operations */
typedef enum : uint8_t {
  k_gptw_all_channels_mask = 0x0F, /**< Bitmask for all 4 GPTW channels (Ch0-3) */
} gptw_channel_mask_t;

/** @brief GPTW count direction values for GTUDDTYC register */
typedef enum : uint32_t {
  k_gptw_gtuddtyc_ud_down = 0, /**< Count direction down (UD bit = 0) */
} gptw_direction_constants_t;

/** @brief Port E pin indices for GPTW motor outputs */
typedef enum : uint8_t {
  k_porte_gptw0_a = 5, /**< PE5/GTIOC0A - Motor 0 phase */
  k_porte_gptw0_b = 2, /**< PE2/GTIOC0B - Motor 0 enable */
  k_porte_gptw1_a = 4, /**< PE4/GTIOC1A - Motor 1 phase */
  k_porte_gptw1_b = 1, /**< PE1/GTIOC1B - Motor 1 enable */
  k_porte_gptw2_a = 3, /**< PE3/GTIOC2A - Motor 2 phase */
  k_porte_gptw2_b = 0, /**< PE0/GTIOC2B - Motor 2 enable */
  k_porte_gptw3_a = 7, /**< PE7/GTIOC3A - Motor 3 phase */
  k_porte_gptw3_b = 6, /**< PE6/GTIOC3B - Motor 3 enable */
} porte_gptw_pin_t;

/* =============================================================================
 * Static Variables
 * =============================================================================
 */

/** @brief Track initialized channels */
static bool s_gptw_initialized[k_gptw_max_channels] = {false};
/** @brief Period values for each channel */
static uint32_t s_gptw_period[k_gptw_max_channels] = {0};

/* =============================================================================
 * Internal Helper Functions
 * =============================================================================
 */

/**
 * @brief Get GPTW channel register base address
 *
 * @details
 * Maps a GPTW channel enumeration value to its corresponding hardware register
 * base address. Each GPTW channel (0-3) has a dedicated register block at a
 * fixed memory offset.
 *
 * ## Memory Map
 *
 * | Channel | Base Address | Offset from GPTW0 |
 * |---------|--------------|-------------------|
 * | k_gptw_channel_0 | 0x000C2100 | 0x000 |
 * | k_gptw_channel_1 | 0x000C2180 | 0x080 |
 * | k_gptw_channel_2 | 0x000C2200 | 0x100 |
 * | k_gptw_channel_3 | 0x000C2280 | 0x180 |
 *
 * @param[in] channel GPTW channel identifier
 *   - Valid range: k_gptw_channel_0 to k_gptw_channel_3
 *   - Values outside this range returnnullptr
 *
 * @return Pointer to GPTW channel register structure
 * @retval Non-NULL Pointer to rx_gptw_channel_regs_t for valid channels
 * @retval NULL Invalid channel value (outside 0-3 range)
 *
 * @pre Module clock must be enabled before accessing returned pointer
 *
 * @post Returned pointer is valid for hardware register access
 * @post No hardware state modified by this function
 *
 * @note Thread-safe: Returns constant address, no state modification
 * @note Caller must check for nullptr before using returned pointer
 *
 * @par Performance:
 * - Execution time: ~10 cycles (switch statement)
 * - Memory: 0 bytes heap, 0 bytes stack allocation
 *
 * @see gptw0(), gptw1(), gptw2(), gptw3() Underlying accessor functions
 * @see rx72n_gptw_regs.h Register structure definition
 *
 * @since Version 1.0.0
 */
static volatile rx_gptw_channel_regs_t* internal_get_gptw_base(const rx_gptw_channel_t channel)
{
  switch (channel) {
    case k_gptw_channel_0:
      return gptw0();
    case k_gptw_channel_1:
      return gptw1();
    case k_gptw_channel_2:
      return gptw2();
    case k_gptw_channel_3:
      return gptw3();
    default:
      return nullptr;
  }
}

/**
 * @brief Check if wave mode is triangle (center-aligned)
 *
 * @details
 * Determines whether the specified waveform mode uses triangle wave (center-aligned)
 * PWM generation. Triangle modes count up to period, then down to zero, resulting
 * in symmetric PWM pulses centered within each period.
 *
 * ## Mode Classification
 *
 * | Mode | Type | Returns |
 * |------|------|---------|
 * | k_gptw_wave_saw_pwm | Sawtooth (edge-aligned) | false |
 * | k_gptw_wave_tri_pwm1 | Triangle (center-aligned) | true |
 * | k_gptw_wave_tri_pwm2 | Triangle (center-aligned) | true |
 * | k_gptw_wave_tri_pwm3 | Triangle (center-aligned) | true |
 *
 * @param[in] mode Waveform mode enumeration value
 *   - Valid values: Any rx_gptw_wave_mode_t enum value
 *   - Invalid values return false (sawtooth assumed)
 *
 * @return bool Mode classification result
 * @retval true Mode is triangle wave (k_gptw_wave_tri_pwm1/2/3)
 * @retval false Mode is sawtooth wave or invalid value
 *
 * @pre mode should be a valid rx_gptw_wave_mode_t value
 *
 * @post No state modification
 *
 * @note Pure function: Same input always produces same output
 * @note Thread-safe: No shared state access
 * @note Inlined for performance in period calculation loop
 *
 * @par Performance:
 * - Execution time: ~3 cycles (two comparisons)
 * - Inlined at call site, no function call overhead
 *
 * @see rx_gptw_wave_mode_t Waveform mode definitions
 * @see internal_calculate_period() Primary user of this function
 *
 * @since Version 1.0.0
 */
static inline bool internal_is_triangle_mode(const rx_gptw_wave_mode_t mode)
{
  return (mode == k_gptw_wave_tri_pwm1) || (mode == k_gptw_wave_tri_pwm2) ||
         (mode == k_gptw_wave_tri_pwm3);
}

/**
 * @brief Get GTCR mode bits for wave mode
 *
 * @details
 * Converts a waveform mode enumeration to the corresponding GTCR.MD register
 * bit field value. The MD field (bits 18:16) in GTCR controls the timer's
 * counting mode and PWM generation behavior.
 *
 * ## GTCR.MD Field Mapping
 *
 * | Input Mode | GTCR.MD Value | Binary | Description |
 * |------------|---------------|--------|-------------|
 * | k_gptw_wave_saw_pwm | k_gptw_gtcr_md_saw_pwm | 0b000 | Sawtooth PWM |
 * | k_gptw_wave_tri_pwm1 | k_gptw_gtcr_md_tri_pwm1 | 0b001 | Triangle PWM 1 |
 * | k_gptw_wave_tri_pwm2 | k_gptw_gtcr_md_tri_pwm2 | 0b010 | Triangle PWM 2 |
 * | k_gptw_wave_tri_pwm3 | k_gptw_gtcr_md_tri_pwm3 | 0b011 | Triangle PWM 3 |
 *
 * @param[in] mode Waveform mode to convert
 *   - Valid range: Any rx_gptw_wave_mode_t enum value
 *   - Invalid values trigger RX_ASSERT and return sawtooth mode
 *
 * @return uint32_t GTCR register value with MD bits set appropriately
 * @retval k_gptw_gtcr_md_saw_pwm For sawtooth mode or invalid input (fallback)
 * @retval k_gptw_gtcr_md_tri_pwm1 For triangle PWM mode 1
 * @retval k_gptw_gtcr_md_tri_pwm2 For triangle PWM mode 2
 * @retval k_gptw_gtcr_md_tri_pwm3 For triangle PWM mode 3
 *
 * @pre mode should be validated before calling (caller's responsibility)
 * @pre GTCR write protection must be unlocked before writing returned value
 *
 * @post No state modification (pure function)
 * @post Returned value is ready for GTCR register write
 *
 * @invariant Invalid modes always return sawtooth as safe fallback
 *
 * @note Assert triggers on invalid mode in debug builds
 * @note Returns safe default (sawtooth) on invalid mode in release builds
 * @note Thread-safe: Pure function with no shared state
 *
 * @warning RX_ASSERT fires if mode is not a valid enum value
 *
 * @par Performance:
 * - Execution time: ~10 cycles (switch statement)
 * - Memory: 0 bytes heap, 0 bytes stack
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] RX_ASSERT validates unexpected conditions
 *
 * @see rx_gptw_wave_mode_t Input enum definition
 * @see RX72N Hardware Manual Section 26.2.12 GTCR register description
 *
 * @since Version 1.0.0
 */
static uint32_t internal_get_gtcr_mode(const rx_gptw_wave_mode_t mode)
{
  switch (mode) {
    case k_gptw_wave_tri_pwm1:
      return k_gptw_gtcr_md_tri_pwm1;
    case k_gptw_wave_tri_pwm2:
      return k_gptw_gtcr_md_tri_pwm2;
    case k_gptw_wave_tri_pwm3:
      return k_gptw_gtcr_md_tri_pwm3;
    case k_gptw_wave_saw_pwm:
      return k_gptw_gtcr_md_saw_pwm;
    default:
      /* Should never reach here if wave_mode was validated upstream (NASA Rule 5) */
      RX_ASSERT(false, "Unexpected wave mode in internal_get_gtcr_mode");
      return k_gptw_gtcr_md_saw_pwm;
  }
}

/**
 * @brief Calculate period register value from frequency
 *
 * @details
 * Converts a desired PWM frequency to the GTPR (period register) count value.
 * The calculation differs based on waveform mode:
 *
 * ## Mathematical Formulas
 *
 * **Sawtooth (edge-aligned) mode:**
 * @f[
 *   \text{period} = \frac{f_{PCLKA}}{f_{PWM}}
 * @f]
 *
 * **Triangle (center-aligned) mode:**
 * @f[
 *   \text{period} = \frac{f_{PCLKA}}{2 \times f_{PWM}}
 * @f]
 *
 * Where:
 * - @f$ f_{PCLKA} @f$ = 120 MHz (peripheral clock A)
 * - @f$ f_{PWM} @f$ = desired PWM frequency
 *
 * ## Algorithm Steps
 *
 * 1. Validate period output pointer (RX_CHECK_NULL_PTR)
 * 2. Validate wave_mode via exhaustive switch statement
 * 3. Determine divisor based on mode (1 for sawtooth, 2 for triangle)
 * 4. Check frequency_hz is non-zero (prevent division by zero)
 * 5. Calculate period using 64-bit arithmetic to prevent overflow
 * 6. Validate period is within hardware limits [10, 0xFFFFFFFF]
 * 7. Store result and return success
 *
 * ## Example Calculations
 *
 * | Frequency | Mode | Period Count | Resolution |
 * |-----------|------|--------------|------------|
 * | 20 kHz | Sawtooth | 6000 | 0.0167% |
 * | 20 kHz | Triangle | 3000 | 0.0333% |
 * | 100 Hz | Sawtooth | 1,200,000 | 0.000083% |
 * | 1 MHz | Sawtooth | 120 | 0.833% |
 *
 * @param[in] frequency_hz Desired PWM frequency in Hz
 *   - Valid range: [1, 12000000] Hz (practical upper limit)
 *   - Frequencies resulting in period < 10 are rejected
 *   - Zero frequency is rejected with k_rx_err_invalid_arg
 * @param[in] wave_mode Waveform mode selection
 *   - Valid values: k_gptw_wave_saw_pwm, k_gptw_wave_tri_pwm1/2/3
 *   - Invalid values rejected with k_rx_err_invalid_arg
 * @param[out] period Pointer to store calculated period count
 *   - Must be non-NULL
 *   - Receives value in range [10, 0xFFFFFFFF]
 *
 * @return rx_err_t Error code indicating result
 * @retval k_rx_ok Success, period contains valid count
 * @retval k_rx_err_null_ptr period pointer is nullptr
 * @retval k_rx_err_invalid_arg wave_mode invalid, frequency=0, or period out of range
 *
 * @pre PCLKA configured to 120 MHz (system clock setup complete)
 * @pre period pointer must point to valid uint32_t storage
 *
 * @post On success, *period contains valid count [10, 0xFFFFFFFF]
 * @post On failure, *period is unchanged
 *
 * @invariant period >= k_gptw_period_min (10) on success
 * @invariant Calculation uses 64-bit math to prevent overflow
 *
 * @note Thread-safe: No shared state modified
 * @note Uses RX_CHECK_NULL_PTR macro for pointer validation
 *
 * @warning Very low frequencies (< 1 Hz) may overflow 32-bit period
 * @warning Very high frequencies (> 12 MHz) produce periods < 10 (rejected)
 *
 * @par Performance:
 * - Execution time: ~50 cycles (64-bit division)
 * - Memory: 0 bytes heap, ~16 bytes stack
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] 2 preconditions (NULL check, wave_mode validation)
 * - Rule 7: [OK] Returns error code, no silent failures
 *
 * @see k_pclka_hz PCLKA clock frequency constant
 * @see internal_is_triangle_mode() Determines divisor selection
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_calculate_period(const uint32_t            frequency_hz,
                                          const rx_gptw_wave_mode_t wave_mode,
                                          uint32_t*                 period)
{
  /* Pre-condition: validate pointer (NASA Power of 10 Rule 5) */
  RX_CHECK_NULL_PTR(period, s_tag, "period pointer is nullptr");

  /* Pre-condition: validate wave_mode using exhaustive switch (catches invalid/negative values) */
  switch (wave_mode) {
    case k_gptw_wave_saw_pwm:
    case k_gptw_wave_tri_pwm1:
    case k_gptw_wave_tri_pwm2:
    case k_gptw_wave_tri_pwm3:
      break;
    default:
      rx_log_error(s_tag, "Invalid wave mode");
      return k_rx_err_invalid_arg;
  }

  /* Period calculation depends on waveform mode:
   * - Sawtooth: Period = PCLKA / frequency
   * - Triangle: Period = PCLKA / (2 * frequency), because counter goes up then down
   * PCLKA = 120 MHz
   */
  const uint32_t pclka = k_pclka_hz;
  const uint32_t divisor =
    internal_is_triangle_mode(wave_mode) ? k_gptw_period_divisor_tri : k_gptw_period_divisor_saw;

  if (frequency_hz == k_gptw_period_zero) {
    rx_log_error(s_tag, "Frequency is zero");
    return k_rx_err_invalid_arg;
  }

  /* Use 64-bit math to prevent overflow in divisor * frequency_hz */
  const uint64_t denominator = (uint64_t)divisor * (uint64_t)frequency_hz;
  const uint32_t period_calc = (uint32_t)(pclka / denominator);

  /* Check if period fits in valid range */
  if (period_calc > s_gptw_period_max) {
    rx_log_error(s_tag, "Frequency too low");
    return k_rx_err_invalid_arg;
  }

  if (period_calc < k_gptw_period_min) {
    rx_log_error(s_tag, "Frequency too high");
    return k_rx_err_invalid_arg;
  }

  *period = period_calc;
  return k_rx_ok;
}

/**
 * @brief Configure MPC for GPTW output pins
 *
 * @details
 * Configures the Multi-Function Pin Controller (MPC) to route GPTW timer outputs
 * to the appropriate Port E pins. Each GPTW channel uses two pins for
 * complementary PWM outputs (GTIOCA and GTIOCB).
 *
 * ## MPC Configuration Sequence
 *
 * 1. Clear PWPR.B0WI to enable PFSWE bit access
 * 2. Set PWPR.PFSWE to enable PFS register writes
 * 3. Write PSEL value (0x14) to select GPTW function for each pin
 * 4. Set PWPR.B0WI to lock PFS registers
 *
 * ## Pin Assignments
 *
 * | Channel | Output A (GTIOCnA) | Output B (GTIOCnB) | PSEL |
 * |---------|--------------------|--------------------|------|
 * | GPTW0 | PE5 | PE2 | 0x14 |
 * | GPTW1 | PE4 | PE1 | 0x14 |
 * | GPTW2 | PE3 | PE0 | 0x14 |
 * | GPTW3 | PE7 | PE6 | 0x14 |
 *
 * @param[in] channel GPTW channel to configure MPC for
 *   - Valid range: k_gptw_channel_0 to k_gptw_channel_3
 *   - Invalid channels return k_rx_err_invalid_arg
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok MPC configuration successful
 * @retval k_rx_err_invalid_arg Invalid channel value
 *
 * @pre MPC module accessible (no separate clock enable required)
 * @pre Pins not in use by other peripherals
 *
 * @post Port E PFS registers configured for GPTW function
 * @post MPC write protection re-enabled
 *
 * @invariant MPC write protection always re-locked on exit (success or failure)
 *
 * @note Modifies global MPC registers, not thread-safe
 * @note Must be called before enabling port pin peripheral mode
 *
 * @warning Overwrites any previous pin function assignment
 * @warning MPC must be unlocked before calling; function handles locking
 *
 * @par Performance:
 * - Execution time: ~20 cycles (register writes)
 * - Memory: 0 bytes heap, ~8 bytes stack
 *
 * @see internal_configure_port_pins() Configure PMR/PDR after MPC
 * @see RX72N Hardware Manual Chapter 23 - Multi-Function Pin Controller
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_configure_mpc(const rx_gptw_channel_t channel)
{
  /* MPC Pin Function Select values for GPTW on Port E
   * Each channel uses 2 pins (GTIOCA and GTIOCB)
   *
   * Pin mapping (from hardware_pinout.h):
   * - GPTW0: PE5/GTIOC0A, PE2/GTIOC0B
   * - GPTW1: PE4/GTIOC1A, PE1/GTIOC1B
   * - GPTW2: PE3/GTIOC2A, PE0/GTIOC2B
   * - GPTW3: PE7/GTIOC3A, PE6/GTIOC3B
   */

  /* Unlock MPC write protection */
  mpc()->pwpr = k_mpc_pwpr_b0wi_clear; /* Clear B0WI */
  mpc()->pwpr = k_mpc_pwpr_pfswe_set;  /* Set PFSWE to enable PFS write */

  /* Configure PFS for the appropriate pins
   * PSEL value for GPTW is 0x14 (verify against HW manual)
   * Note: Port E PFS registers not in rx_mpc_regs_t structure,
   * so we use base + offset calculation */
  volatile uint8_t* pe_pfs = (volatile uint8_t*)((uintptr_t)mpc() + k_mpc_pfs_base_offset +
                                                 k_mpc_port_e_index * k_mpc_pfs_port_stride);

  switch (channel) {
    case k_gptw_channel_0:
      /* PE5/GTIOC0A and PE2/GTIOC0B */
      pe_pfs[k_porte_gptw0_a] = k_pfs_psel_gptw;
      pe_pfs[k_porte_gptw0_b] = k_pfs_psel_gptw;
      break;
    case k_gptw_channel_1:
      /* PE4/GTIOC1A and PE1/GTIOC1B */
      pe_pfs[k_porte_gptw1_a] = k_pfs_psel_gptw;
      pe_pfs[k_porte_gptw1_b] = k_pfs_psel_gptw;
      break;
    case k_gptw_channel_2:
      /* PE3/GTIOC2A and PE0/GTIOC2B */
      pe_pfs[k_porte_gptw2_a] = k_pfs_psel_gptw;
      pe_pfs[k_porte_gptw2_b] = k_pfs_psel_gptw;
      break;
    case k_gptw_channel_3:
      /* PE7/GTIOC3A and PE6/GTIOC3B */
      pe_pfs[k_porte_gptw3_a] = k_pfs_psel_gptw;
      pe_pfs[k_porte_gptw3_b] = k_pfs_psel_gptw;
      break;
    default:
      mpc()->pwpr = k_mpc_pwpr_lock; /* Lock before returning error */
      return k_rx_err_invalid_arg;
  }

