Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_gptw.c
  /* Lock MPC write protection */
  mpc()->pwpr = k_mpc_pwpr_lock;

  return k_rx_ok;
}

/**
 * @brief Configure Port E pins as peripheral outputs
 *
 * @details
 * Configures the Port E GPIO pins for GPTW peripheral output mode. Sets both the
 * Peripheral Mode Register (PMR) and Port Direction Register (PDR) to enable
 * GPTW timer outputs.
 *
 * ## Register Configuration
 *
 * For each pin used by the specified channel:
 * - **PMR bit = 1**: Enable peripheral mode (not GPIO)
 * - **PDR bit = 1**: Set pin direction to output
 *
 * ## Pin Mapping
 *
 * | Channel | Output A Pin | Output B Pin |
 * |---------|--------------|--------------|
 * | GPTW0 | PE5 (bit 5) | PE2 (bit 2) |
 * | GPTW1 | PE4 (bit 4) | PE1 (bit 1) |
 * | GPTW2 | PE3 (bit 3) | PE0 (bit 0) |
 * | GPTW3 | PE7 (bit 7) | PE6 (bit 6) |
 *
 * @param[in] channel GPTW channel whose pins to configure
 *   - Valid range: k_gptw_channel_0 to k_gptw_channel_3
 *   - Invalid channels result in no action (no error)
 *
 * @pre MPC configured for GPTW function via internal_configure_mpc()
 * @pre Port E GPIO registers accessible
 *
 * @post PMR bits set for both channel pins
 * @post PDR bits set for both channel pins
 *
 * @note No return value - silent no-op on invalid channel
 * @note Modifies Port E registers, not thread-safe
 * @note Uses OR-equals to preserve other pin configurations
 *
 * @par Performance:
 * - Execution time: ~10 cycles (register read-modify-write)
 * - Memory: 0 bytes heap, 0 bytes stack
 *
 * @see internal_configure_mpc() Must be called before this function
 * @see porte() Port E register accessor
 *
 * @since Version 1.0.0
 */
static void internal_configure_port_pins(const rx_gptw_channel_t channel)
{
  /* Set pins as output and enable peripheral function
   * PMR = 1 (peripheral mode), PDR = 1 (output)
   */
  switch (channel) {
    case k_gptw_channel_0:
      porte()->pmr |= (k_gptw_bit_set << k_porte_gptw0_a) | (k_gptw_bit_set << k_porte_gptw0_b);
      porte()->pdr |= (k_gptw_bit_set << k_porte_gptw0_a) | (k_gptw_bit_set << k_porte_gptw0_b);
      break;
    case k_gptw_channel_1:
      porte()->pmr |= (k_gptw_bit_set << k_porte_gptw1_a) | (k_gptw_bit_set << k_porte_gptw1_b);
      porte()->pdr |= (k_gptw_bit_set << k_porte_gptw1_a) | (k_gptw_bit_set << k_porte_gptw1_b);
      break;
    case k_gptw_channel_2:
      porte()->pmr |= (k_gptw_bit_set << k_porte_gptw2_a) | (k_gptw_bit_set << k_porte_gptw2_b);
      porte()->pdr |= (k_gptw_bit_set << k_porte_gptw2_a) | (k_gptw_bit_set << k_porte_gptw2_b);
      break;
    case k_gptw_channel_3:
      porte()->pmr |= (k_gptw_bit_set << k_porte_gptw3_a) | (k_gptw_bit_set << k_porte_gptw3_b);
      porte()->pdr |= (k_gptw_bit_set << k_porte_gptw3_a) | (k_gptw_bit_set << k_porte_gptw3_b);
      break;
    default:
      break;
  }
}

/**
 * @brief Enable GPTW module clock
 *
 * @details
 * Enables the GPTW peripheral by clearing its module stop bit in MSTPCRC.
 * The GPTW module is controlled by MSTPCRC.MSTPC10 (bit 10). When set, the
 * module clock is stopped and registers are inaccessible.
 *
 * ## Register Access Sequence
 *
 * 1. **Unlock PRCR**: Write 0xA503 to enable writing to protected registers
 * 2. **Clear MSTPC10**: AND-mask to clear bit 10 in MSTPCRC
 * 3. **Lock PRCR**: Write 0xA500 to re-enable protection
 *
 * ## Module Stop Control
 *
 * | Bit | Value | Effect |
 * |-----|-------|--------|
 * | MSTPCRC.MSTPC10 = 1 | Module stopped | Registers inaccessible, low power |
 * | MSTPCRC.MSTPC10 = 0 | Module running | Registers accessible, clock active |
 *
 * @pre System clock configured
 *
 * @post GPTW module clock enabled
 * @post GPTW registers accessible
 * @post PRCR protection re-enabled
 *
 * @invariant PRCR always re-locked after modification
 *
 * @note Not thread-safe: Modifies system-wide registers
 * @note Idempotent: Safe to call multiple times
 *
 * @warning Must be called before any GPTW register access
 * @warning Modifies system protection register (PRCR)
 *
 * @par Performance:
 * - Execution time: ~15 cycles (3 register writes)
 * - Memory: 0 bytes heap, 0 bytes stack
 *
 * @see k_mstpc_gptw GPTW module stop bit position
 * @see k_rx_prcr_unlock_prc1_prc3 PRCR unlock value
 * @see RX72N Hardware Manual Chapter 11 - Low Power Consumption
 *
 * @since Version 1.0.0
 */
static void internal_enable_gptw_module_clock(void)
{
  *prcr_reg() = k_rx_prcr_unlock_prc1_prc3;
  system_regs()->mstpcrc &= ~((uint32_t)k_gptw_bit_set << k_mstpc_gptw);
  *prcr_reg() = k_rx_prcr_lock;
}

/**
 * @brief Configure GPTW hardware registers
 *
 * @details
 * Performs the core hardware configuration of a GPTW channel. This function
 * writes all necessary registers to set up PWM operation including control mode,
 * I/O configuration, period, duty cycle initialization, buffer mode, and deadtime.
 *
 * ## Register Configuration Sequence
 *
 * 1. **Unlock write protection**: GTWP = 0xA500_0000
 * 2. **Configure control register (GTCR)**:
 *    - Set clock source to PCLKA/1 (120 MHz)
 *    - Set waveform mode (sawtooth or triangle)
 * 3. **Configure I/O control (GTIOR)**:
 *    - Output A: Initial low, toggle on compare match, enable
 *    - Output B: Initial low, toggle on compare match, enable
 * 4. **Set period register (GTPR)**: PWM cycle count
 * 5. **Initialize duty cycles (GTCCRA, GTCCRB)**: Both to 0
 * 6. **Clear counter (GTCNT)**: Start at 0
 * 7. **Enable buffer operation (GTBER)**: Glitch-free updates
 * 8. **Configure deadtime (GTDVU, GTDVD, GTDTCR)**: If requested
 * 9. **Lock write protection**: GTWP = 0x0000_0001
 *
 * ## Deadtime Calculation
 *
 * @f[
 *   \text{deadtime\_counts} = \frac{\text{deadtime\_ns} \times f_{PCLKA}}{10^9}
 * @f]
 *
 * For 1000 ns at 120 MHz: deadtime_counts = 120
 *
 * @param[in] gptw Pointer to GPTW channel register structure
 *   - Must be non-NULL
 *   - Must point to valid GPTW register base (from internal_get_gptw_base)
 * @param[in] config Configuration parameters structure
 *   - Must be non-NULL
 *   - wave_mode determines GTCR.MD field
 *   - deadtime_ns determines deadtime register values
 * @param[in] period Pre-calculated period register value
 *   - Valid range: [k_gptw_period_min, s_gptw_period_max]
 *   - Obtained from internal_calculate_period()
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Configuration successful
 * @retval k_rx_err_null_ptr gptw or config is nullptr
 * @retval k_rx_err_invalid_arg period outside valid range [10, 0xFFFFFFFF]
 *
 * @pre gptw points to valid, unlocked GPTW registers
 * @pre config contains validated parameters
 * @pre period calculated and validated by internal_calculate_period()
 *
 * @post GPTW channel configured for PWM operation
 * @post Duty cycles initialized to 0% (motor stopped)
 * @post Buffer mode enabled for glitch-free updates
 * @post Write protection re-enabled
 *
 * @invariant Write protection always re-locked on exit
 * @invariant Duty cycles always start at 0 (safe state)
 *
 * @note Not thread-safe: Direct hardware register access
 * @note Timer is NOT started by this function
 *
 * @warning gptw pointer must be valid - no runtime bounds checking
 * @warning Caller responsible for stopping timer before calling
 *
 * @par Performance:
 * - Execution time: ~100 cycles (multiple register writes)
 * - Memory: 0 bytes heap, ~16 bytes stack
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] 3 preconditions (NULL checks, period range)
 *
 * @see internal_calculate_period() Period value calculation
 * @see rx72n_gptw_regs.h Register structure definition
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_configure_gptw_hardware(volatile rx_gptw_channel_regs_t* gptw,
                                                 const rx_gptw_config_t*          config,
                                                 const uint32_t                   period)
{
  /* Pre-condition: validate pointers (NASA Power of 10 Rule 5) */
  RX_CHECK_NULL_PTR(gptw, s_tag, "gptw pointer is nullptr");
  RX_CHECK_NULL_PTR(config, s_tag, "config pointer is nullptr");

  /* Pre-condition: validate period range */
  if ((period < k_gptw_period_min) || (period > s_gptw_period_max)) {
    rx_log_error(s_tag, "Period out of range");
    return k_rx_err_invalid_arg;
  }

  /* Unlock write protection for this channel */
  gptw->gtwp = k_gptw_gtwp_unlock;

  /* Configure control register
   * - PCLKA/1 (120 MHz)
   * - Waveform mode from config (sawtooth or triangle)
   */
  const uint32_t gtcr_mode = internal_get_gtcr_mode(config->wave_mode);
  gptw->gtcr               = k_gptw_gtcr_tpcs_1 | gtcr_mode;

  /* Configure I/O control register
   * - Initial low, toggle on compare match for both outputs
   * - Enable both outputs
   */
  gptw->gtior =
    k_gptw_gtior_oa_init_low | k_gptw_gtior_oae | k_gptw_gtior_ob_init_low | k_gptw_gtior_obe;

  /* Set period (GTPR = PWM cycle) */
  gptw->gtpr = period;

  /* Set initial duty cycle to 0% for both outputs */
  gptw->gtccra = k_gptw_period_zero;
  gptw->gtccrb = k_gptw_period_zero;

  /* Clear counter */
  gptw->gtcnt = k_gptw_period_zero;

  /* Enable buffer operation for glitch-free updates */
  gptw->gtber = k_gptw_gtber_ccra_buf | k_gptw_gtber_ccrb_buf;

  /* Configure dead time if requested */
  if (config->deadtime_ns > k_gptw_deadtime_disabled) {
    /* Calculate dead time count: deadtime_ns * (PCLKA / 1e9) */
    const uint32_t deadtime_count =
      (uint32_t)((uint64_t)config->deadtime_ns * k_pclka_hz / s_gptw_ns_per_second);
    gptw->gtdvu  = deadtime_count;
    gptw->gtdvd  = deadtime_count;
    gptw->gtdtcr = k_gptw_gtdtcr_tde; /* Enable dead time */
  }

