Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_gptw.c
  /* Lock write protection */
  gptw->gtwp = k_gptw_gtwp_lock;

  return k_rx_ok;
}

/**
 * @brief Validate channel and compute period for PWM initialization
 *
 * @details
 * Shared pre-initialization helper used by rx_gptw_init_pwm(). Performs
 * two actions in a single function to reduce code duplication:
 * 1. Validate channel range and resolve register base pointer
 * 2. Calculate the GTPR period value from frequency and wave mode
 *
 * @param[in]  channel    GPTW channel to initialize
 *   - Valid range: k_gptw_channel_0 to k_gptw_channel_3
 * @param[in]  config     Configuration structure (caller guarantees non-NULL)
 *   - config->frequency_hz and config->wave_mode are used
 * @param[out] gptw_out   Pointer-to-pointer to receive the channel register base
 *   - Must be non-NULL; *gptw_out set on success
 * @param[out] period_out Pointer to receive the calculated period count
 *   - Must be non-NULL; *period_out set on success
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Validation and period calculation succeeded
 * @retval k_rx_err_invalid_arg channel out of range or register base unresolvable
 * @retval k_rx_err_invalid_arg frequency_hz is zero, wave_mode invalid, or period out of range
 *
 * @pre gptw_out and period_out must be non-NULL (caller's responsibility)
 * @pre config must be non-NULL (caller's responsibility)
 *
 * @post *gptw_out points to valid GPTW channel registers on success
 * @post *period_out contains a value in [k_gptw_period_min, s_gptw_period_max] on success
 *
 * @note Pure helper: does not modify hardware registers or module state
 * @note Not thread-safe: relies on config content stability during call
 *
 * @see internal_calculate_period() Period calculation details
 * @see rx_gptw_init_pwm() Primary caller
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_prepare_gptw_pwm_init(const rx_gptw_channel_t           channel,
                                               const rx_gptw_config_t*           config,
                                               volatile rx_gptw_channel_regs_t** gptw_out,
                                               uint32_t*                         period_out)
{
  if ((int32_t)channel >= (int32_t)k_gptw_max_channels) {
    rx_log_error(s_tag, "Invalid GPTW channel");
    return k_rx_err_invalid_arg;
  }

  *gptw_out = internal_get_gptw_base(channel);
  if (*gptw_out == nullptr) {
    return k_rx_err_invalid_arg;
  }

  rx_err_t err = internal_calculate_period(config->frequency_hz, config->wave_mode, period_out);
  if (err != k_rx_ok) {
    return err;
  }

  return k_rx_ok;
}

/* =============================================================================
 * Public API Implementation
 * =============================================================================
 */

/**
 * @brief Initialize a single GPTW channel for PWM operation
 *
 * @details
 * Configures one GPTW channel for PWM generation. This function performs complete
 * hardware setup including module clock enable, MPC configuration, port pin setup,
 * timer configuration, and automatic timer start. For 4-motor systems, prefer
 * rx_gptw_init_all_staggered() instead.
 *
 * ## Initialization Sequence
 *
 * 1. Validate config pointer (RX_CHECK_NULL_PTR)
 * 2. Validate channel range [0-3]
 * 3. Get channel register base address
 * 4. Calculate period from frequency and wave mode
 * 5. Enable GPTW module clock (MSTPCRC.MSTPC10)
 * 6. Stop timer if already running
 * 7. Configure GPTW hardware registers (GTCR, GTIOR, GTPR, etc.)
 * 8. Configure MPC for Port E alternate function
 * 9. Configure port pins (PMR, PDR)
 * 10. Store period value and set initialized flag
 * 11. Start timer
 *
 * @param[in] channel GPTW channel to initialize
 *   - Valid range: k_gptw_channel_0 to k_gptw_channel_3
 *   - Invalid channels return k_rx_err_invalid_arg
 * @param[in] config PWM configuration parameters
 *   - Must be non-NULL
 *   - See rx_gptw_config_t for field descriptions
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Channel initialized and running successfully
 * @retval k_rx_err_null_ptr config pointer is nullptr
 * @retval k_rx_err_invalid_arg channel out of range, frequency=0, or invalid wave_mode
 * @retval k_rx_err_hw_error Failed to get register base address
 *
 * @pre System clock configured (PCLKA = 120 MHz)
 * @pre Port E pins not used by other peripherals
 *
 * @post GPTW channel configured and running
 * @post Duty cycle initialized to 0%
 * @post MPC and port pins configured
 *
 * @invariant s_gptw_initialized[channel] == true on success
 * @invariant s_gptw_period[channel] contains valid period on success
 *
 * @note Not thread-safe: Call once during system initialization
 * @note Timer starts automatically - use rx_gptw_stop() to halt if needed
 *
 * @warning Calling while channel is running will cause glitches
 * @attention For 4-motor systems, use rx_gptw_init_all_staggered() instead
 *
 * @par Performance:
 * - Execution time: ~50 us at 240 MHz
 * - Memory: 0 bytes heap, ~32 bytes stack
 *
 * @par Example (Single Channel for LED PWM):
 * @code{.c}
 * rx_gptw_config_t led_config = {
 *     .frequency_hz = 1000,
 *     .deadtime_ns = 0,
 *     .wave_mode = k_gptw_wave_saw_pwm,
 *     .enable_complementary = false,
 *     .invert_polarity = false
 * };
 *
 * rx_err_t err = rx_gptw_init_pwm(k_gptw_channel_0, &led_config);
 * if (err == k_rx_ok) {
 *     rx_gptw_set_duty(rx_gptw_channel_id(k_gptw_channel_0),
 *                      rx_gptw_output_id(k_gptw_output_a), 50.0f);
 * }
 * @endcode
 *
 * @see rx_gptw_init_all_staggered() Preferred for 4-motor systems
 * @see rx_gptw_deinit() Cleanup function
 * @see rx_gptw_config_t Configuration structure
 *
 * @since Version 1.0.0
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] nullptr check, channel range check
 * - Rule 7: [OK] All internal function returns checked
 *
 * @callgraph
 */
rx_err_t rx_gptw_init_pwm(const rx_gptw_channel_t channel, const rx_gptw_config_t* config)
{
  RX_CHECK_NULL_PTR(config, s_tag, "config pointer is nullptr");

  volatile rx_gptw_channel_regs_t* gptw   = nullptr;
  uint32_t                         period = 0U;
  rx_err_t err = internal_prepare_gptw_pwm_init(channel, config, &gptw, &period);
  if (err != k_rx_ok) {
    return err;
  }

  rx_log_info(s_tag, "Initializing GPTW");

  /* Enable GPTW module clock */
  internal_enable_gptw_module_clock();

