Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_gptw.c
  /* Stop timer before configuration */
  err = rx_gptw_stop(channel);
  if (err != k_rx_ok) {
    rx_log_error(s_tag, "Failed to stop GPTW");
    return err;
  }

  /* Configure GPTW hardware registers */
  err = internal_configure_gptw_hardware(gptw, config, period);
  if (err != k_rx_ok) {
    rx_log_error(s_tag, "Failed to configure GPTW hardware");
    return err;
  }

  /* Configure MPC for Port E alternate functions */
  err = internal_configure_mpc(channel);
  if (err != k_rx_ok) {
    rx_log_error(s_tag, "Failed to configure MPC");
    return err;
  }

  /* Configure port pins */
  internal_configure_port_pins(channel);

  /* Save period for duty cycle calculations */
  s_gptw_period[channel]      = period;
  s_gptw_initialized[channel] = true;

  /* Start timer */
  err = rx_gptw_start(channel);
  if (err != k_rx_ok) {
    rx_log_error(s_tag, "Failed to start GPTW");
    return err;
  }

  rx_log_info(s_tag, "GPTW initialized successfully");

  return k_rx_ok;
}

/**
 * @brief Set PWM duty cycle using floating-point percentage
 *
 * @details
 * Converts floating-point duty percentage [0.0, 100.0] to raw count value and
 * delegates to rx_gptw_set_duty_raw() for hardware register update. The compare
 * register (GTCCRA or GTCCRB) is written and the change takes effect on the next
 * PWM period boundary (glitch-free via buffer mode).
 *
 * @par Algorithm:
 * @f[
 *   \text{duty\_count} = \left\lfloor \frac{\text{duty\_percent} \times \text{period}}{100} \right\rfloor
 * @f]
 *
 * @param[in] channel      Typed channel identifier (use rx_gptw_channel_id())
 * @param[in] output       Typed output identifier (use rx_gptw_output_id())
 * @param[in] duty_percent Duty cycle [0.0, 100.0] percent
 *   - 0.0 = always-off, 100.0 = always-on
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Duty cycle updated successfully
 * @retval k_rx_err_invalid_state Channel out of range or not initialized
 * @retval k_rx_err_invalid_arg duty_percent outside [0.0, 100.0] or invalid output
 *
 * @pre Channel must be initialized via rx_gptw_init_*()
 * @pre duty_percent must be in [0.0, 100.0]
 *
 * @post Compare register written; change takes effect next period boundary
 * @post Motor output drive updated on next PWM cycle
 *
 * @note Not thread-safe: concurrent writes to same output cause undefined behavior
 *
 * @code{.c}
 * rx_gptw_set_duty(rx_gptw_channel_id(k_gptw_channel_0),
 *                  rx_gptw_output_id(k_gptw_output_a), 75.0f);
 * @endcode
 *
 * @see rx_gptw_set_duty_raw() Set duty using raw count value
 * @see rx_gptw_get_duty() Read current duty cycle
 *
 * @since Version 1.0.0
 */
rx_err_t rx_gptw_set_duty(const rx_gptw_channel_id_t channel,
                          const rx_gptw_output_id_t  output,
                          const float                duty_percent)
{
  const rx_gptw_channel_t channel_value = channel.value;
  const rx_gptw_output_t  output_value  = output.value;

  if (((int32_t)channel_value >= (int32_t)k_gptw_max_channels) ||
      !s_gptw_initialized[channel_value]) {
    return k_rx_err_invalid_state;
  }

  if (duty_percent < (float)k_gptw_duty_min || duty_percent > (float)k_gptw_duty_max) {
    rx_log_error(s_tag, "Invalid duty cycle");
    return k_rx_err_invalid_arg;
  }

  /* Convert percentage to count value */
  const uint32_t period       = s_gptw_period[channel_value];
  const float    period_f     = (float)period;
  const float    duty_count_f = (duty_percent * period_f) / (float)k_gptw_duty_divisor;
  const uint32_t duty_count   = (uint32_t)duty_count_f;

  return rx_gptw_set_duty_raw(channel_value, output_value, duty_count);
}

/**
 * @brief Set PWM duty cycle using a raw 32-bit timer count
 *
 * @details
 * Directly writes duty_count to the compare register (GTCCRA or GTCCRB).
 * Buffer mode (enabled during init via GTBER) ensures the update takes effect
 * on the next PWM period boundary without glitches. Values exceeding the period
 * are clamped to period (100% duty).
 *
 * @par Register Access:
 * - Output A: Writes to GTCCRA
 * - Output B: Writes to GTCCRB
 *
 * @param[in] channel    GPTW channel (k_gptw_channel_0 to k_gptw_channel_3)
 * @param[in] output     Output to update (k_gptw_output_a or k_gptw_output_b)
 * @param[in] duty_count Raw count [0, period]; values > period clamped to period
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Duty count written successfully
 * @retval k_rx_err_invalid_state Channel out of range or not initialized
 * @retval k_rx_err_invalid_arg Could not resolve register base or invalid output
 *
 * @pre Channel must be initialized via rx_gptw_init_*()
 * @pre duty_count should be in [0, period] for meaningful duty; higher values clamped
 *
 * @post GTCCRA or GTCCRB written with clamped duty_count
 * @post Change takes effect at next PWM period boundary
 *
 * @note Not thread-safe: concurrent writes to the same register cause undefined behavior
 * @note Values exceeding period are silently clamped to period
 *
 * @code{.c}
 * uint32_t period;
 * rx_gptw_get_period(k_gptw_channel_0, &period);
 * rx_gptw_set_duty_raw(k_gptw_channel_0, k_gptw_output_a, period / 2U); // 50%
 * @endcode
 *
 * @see rx_gptw_set_duty() Set duty using floating-point percentage
 * @see rx_gptw_get_period() Retrieve period count for duty calculation
 *
 * @since Version 1.0.0
 */
rx_err_t
rx_gptw_set_duty_raw(const rx_gptw_channel_t channel, rx_gptw_output_t output, uint32_t duty_count)
{
  if (((int32_t)channel >= (int32_t)k_gptw_max_channels) || !s_gptw_initialized[channel]) {
    return k_rx_err_invalid_state;
  }

  volatile rx_gptw_channel_regs_t* gptw = internal_get_gptw_base(channel);
  if (gptw == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Clamp to period */
  const uint32_t period = s_gptw_period[channel];
  if (duty_count > period) {
    duty_count = period;
  }

  /* Update duty cycle (buffered, takes effect on next period) */
  switch (output) {
    case k_gptw_output_a:
      gptw->gtccra = duty_count;
      break;
    case k_gptw_output_b:
      gptw->gtccrb = duty_count;
      break;
    default:
      return k_rx_err_invalid_arg;
  }

