Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_gptw.c
  return k_rx_ok;
}

/**
 * @brief Read the current PWM duty cycle as a floating-point percentage
 *
 * @details
 * Reads the current compare register value (GTCCRA or GTCCRB) from hardware
 * and converts it to a percentage using the cached period from s_gptw_period[].
 *
 * @par Algorithm:
 * @f[
 *   \text{duty\_percent} = \frac{\text{duty\_count} \times 100}{\text{period}}
 * @f]
 *
 * @param[in]  channel      GPTW channel (k_gptw_channel_0 to k_gptw_channel_3)
 * @param[in]  output       Output to read (k_gptw_output_a or k_gptw_output_b)
 * @param[out] duty_percent Pointer to store percentage result [0.0, 100.0]
 *   - Must be non-NULL
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Percentage written to *duty_percent
 * @retval k_rx_err_null_ptr duty_percent is nullptr
 * @retval k_rx_err_invalid_state Channel out of range or not initialized
 * @retval k_rx_err_invalid_arg Invalid output or register pointer unresolvable
 *
 * @pre Channel must be initialized via rx_gptw_init_*()
 * @pre duty_percent must point to valid float storage
 *
 * @post *duty_percent contains duty cycle in [0.0, 100.0] on success
 * @post Hardware registers unchanged
 *
 * @note Returns actual register value; may differ from the last set value if
 *       buffer transfer has not yet occurred at period boundary
 * @note Not thread-safe: concurrent rx_gptw_set_duty calls may cause torn reads
 *
 * @code{.c}
 * float duty;
 * rx_err_t err = rx_gptw_get_duty(k_gptw_channel_0, k_gptw_output_a, &duty);
 * @endcode
 *
 * @see rx_gptw_set_duty() Set duty using floating-point percentage
 * @see rx_gptw_get_period() Retrieve period count
 *
 * @since Version 1.0.0
 */
rx_err_t rx_gptw_get_duty(const rx_gptw_channel_t channel,
                          const rx_gptw_output_t  output,
                          float*                  duty_percent)
{
  RX_CHECK_NULL_PTR(duty_percent, s_tag, "duty_percent pointer is nullptr");

  if (((int32_t)channel >= (int32_t)k_gptw_max_channels) || !s_gptw_initialized[channel]) {
    return k_rx_err_invalid_state;
  }

  const volatile rx_gptw_channel_regs_t* gptw = internal_get_gptw_base(channel);
  if (gptw == nullptr) {
    return k_rx_err_invalid_arg;
  }

  const uint32_t period     = s_gptw_period[channel];
  uint32_t       duty_count = k_gptw_period_zero;

  switch (output) {
    case k_gptw_output_a:
      duty_count = gptw->gtccra;
      break;
    case k_gptw_output_b:
      duty_count = gptw->gtccrb;
      break;
    default:
      return k_rx_err_invalid_arg;
  }

  *duty_percent = ((float)duty_count * (float)k_gptw_duty_max) / (float)period;

  return k_rx_ok;
}

/**
 * @brief Get PWM period count for GPTW channel
 *
 * @details
 * Implementation of rx_gptw_get_period() - see rx_gptw.h for complete documentation.
 *
 * Returns the cached period value from s_gptw_period[], which matches the
 * GTPR register value set during initialization.
 *
 * @param[in] channel GPTW channel to query
 *   - Valid range: k_gptw_channel_0 to k_gptw_channel_3
 * @param[out] period_count Pointer to store period count value
 *   - Must be non-NULL
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Success, period_count contains valid value
 * @retval k_rx_err_null_ptr period_count is nullptr
 * @retval k_rx_err_invalid_state Channel not initialized
 *
 * @pre Channel initialized via rx_gptw_init_*()
 * @pre period_count points to valid uint32_t storage
 *
 * @post *period_count contains period value on success
 *
 * @note Thread-safe: Reads from cached value, not hardware
 * @note Useful for calculating raw duty counts from percentages
 *
 * @see rx_gptw.h Complete API documentation
 */
rx_err_t rx_gptw_get_period(const rx_gptw_channel_t channel, uint32_t* period_count)
{
  RX_CHECK_NULL_PTR(period_count, s_tag, "period_count pointer is nullptr");

  if (((int32_t)channel >= (int32_t)k_gptw_max_channels) || !s_gptw_initialized[channel]) {
    return k_rx_err_invalid_state;
  }

  *period_count = s_gptw_period[channel];
  return k_rx_ok;
}

/**
 * @brief Enable or disable GPTW output pin
 *
 * @details
 * Implementation of rx_gptw_enable_output() - see rx_gptw.h for complete documentation.
 *
 * Controls the Output Enable bits (OAE/OBE) in the GTIOR register. When disabled,
 * the corresponding output pin is held in its initial state (typically LOW).
 *
 * ## Register Modification
 *
 * | Output | Bit Modified | Effect |
 * |--------|--------------|--------|
 * | Output A | GTIOR.OAE | Enable/disable GTIOCnA pin |
 * | Output B | GTIOR.OBE | Enable/disable GTIOCnB pin |
 *
 * @param[in] channel GPTW channel (0-3)
 * @param[in] output Output to control (k_gptw_output_a or k_gptw_output_b)
 * @param[in] enable true to enable PWM output, false to disable (hold LOW)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Output enable state changed successfully
 * @retval k_rx_err_invalid_state Channel not initialized
 * @retval k_rx_err_invalid_arg Invalid channel or output value
 *
 * @pre Channel initialized via rx_gptw_init_*()
 *
 * @post GTIOR.OAE or GTIOR.OBE modified
 * @post Write protection re-enabled
 *
 * @note Not thread-safe: Modifies hardware registers
 * @note Timer continues running even when output disabled
 *
 * @warning Disable outputs before motor emergency stop to ensure safe state
 *
 * @see rx_gptw.h Complete API documentation
 */
rx_err_t
rx_gptw_enable_output(const rx_gptw_channel_t channel, const rx_gptw_output_t output, bool enable)
{
  if (((int32_t)channel >= (int32_t)k_gptw_max_channels) || !s_gptw_initialized[channel]) {
    return k_rx_err_invalid_state;
  }

  volatile rx_gptw_channel_regs_t* gptw = internal_get_gptw_base(channel);
  if (gptw == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Unlock for modification */
  gptw->gtwp = k_gptw_gtwp_unlock;

  /* Modify GTIOR to enable/disable output */
  switch (output) {
    case k_gptw_output_a:
      if (enable) {
        gptw->gtior |= k_gptw_gtior_oae;
      } else {
        gptw->gtior &= ~k_gptw_gtior_oae;
      }
      break;
    case k_gptw_output_b:
      if (enable) {
        gptw->gtior |= k_gptw_gtior_obe;
      } else {
        gptw->gtior &= ~k_gptw_gtior_obe;
      }
      break;
    default:
      gptw->gtwp = k_gptw_gtwp_lock;
      return k_rx_err_invalid_arg;
  }

  gptw->gtwp = k_gptw_gtwp_lock;

