Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_gptw.c
  return k_rx_ok;
}

/**
 * @brief Start GPTW counter (begin PWM generation)
 *
 * @details
 * Implementation of rx_gptw_start() - see rx_gptw.h for complete documentation.
 *
 * Sets the Count Start (CST) bit in GTCR to begin counter operation. The timer
 * will count according to the configured waveform mode (sawtooth or triangle)
 * and generate PWM output on the enabled pins.
 *
 * ## Register Access
 *
 * 1. Unlock write protection (GTWP)
 * 2. Set GTCR.CST bit
 * 3. Lock write protection (GTWP)
 *
 * @param[in] channel GPTW channel to start
 *   - Valid range: k_gptw_channel_0 to k_gptw_channel_3
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Timer started successfully
 * @retval k_rx_err_invalid_arg Invalid channel value
 *
 * @pre Channel configured via rx_gptw_init_*() (recommended)
 *
 * @post Timer counting actively
 * @post PWM output generated on enabled pins
 *
 * @note Does NOT require channel to be "initialized" (no flag check)
 * @note Timer automatically started during rx_gptw_init_*()
 * @note Idempotent: Safe to call when already running
 *
 * @see rx_gptw_stop() Stop the timer
 * @see rx_gptw.h Complete API documentation
 */
rx_err_t rx_gptw_start(const rx_gptw_channel_t channel)
{
  if ((int32_t)channel >= (int32_t)k_gptw_max_channels) {
    return k_rx_err_invalid_arg;
  }

  volatile rx_gptw_channel_regs_t* gptw = internal_get_gptw_base(channel);
  if (gptw == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Unlock and set CST bit in GTCR */
  gptw->gtwp = k_gptw_gtwp_unlock;
  gptw->gtcr |= k_gptw_gtcr_cst;
  gptw->gtwp = k_gptw_gtwp_lock;

  return k_rx_ok;
}

/**
 * @brief Stop GPTW counter (halt PWM generation)
 *
 * @details
 * Implementation of rx_gptw_stop() - see rx_gptw.h for complete documentation.
 *
 * Clears the Count Start (CST) bit in GTCR to halt counter operation. The timer
 * counter value (GTCNT) is preserved and PWM outputs hold their current state.
 *
 * ## Register Access
 *
 * 1. Unlock write protection (GTWP)
 * 2. Clear GTCR.CST bit
 * 3. Lock write protection (GTWP)
 *
 * @param[in] channel GPTW channel to stop
 *   - Valid range: k_gptw_channel_0 to k_gptw_channel_3
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Timer stopped successfully
 * @retval k_rx_err_invalid_arg Invalid channel value
 *
 * @pre None (can be called on uninitialized channel)
 *
 * @post Timer stopped (GTCR.CST = 0)
 * @post Counter value preserved (GTCNT unchanged)
 * @post Output pins hold last state
 *
 * @note Does NOT require channel to be "initialized" (no flag check)
 * @note Idempotent: Safe to call when already stopped
 * @note For safety shutdown, also disable outputs via rx_gptw_enable_output()
 *
 * @warning Outputs may remain HIGH when stopped - disable outputs for safe state
 *
 * @see rx_gptw_start() Resume the timer
 * @see rx_gptw_enable_output() Disable outputs for safe state
 * @see rx_gptw.h Complete API documentation
 */
rx_err_t rx_gptw_stop(const rx_gptw_channel_t channel)
{
  if ((int32_t)channel >= (int32_t)k_gptw_max_channels) {
    return k_rx_err_invalid_arg;
  }

  volatile rx_gptw_channel_regs_t* gptw = internal_get_gptw_base(channel);
  if (gptw == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Unlock and clear CST bit in GTCR */
  gptw->gtwp = k_gptw_gtwp_unlock;
  gptw->gtcr &= ~k_gptw_gtcr_cst;
  gptw->gtwp = k_gptw_gtwp_lock;

  return k_rx_ok;
}

/* =============================================================================
 * Phase Staggering Implementation
 * =============================================================================
 */

/**
 * @enum gptw_phase_divisor_t
 * @brief Phase divisors for staggered PWM initialization
 *
 * @details
 * Divisor constants used to calculate the initial GTCNT counter value for each
 * GPTW channel during staggered initialization. Each channel is offset by
 * 90 degrees from the previous one to spread switching edges across the PWM period.
 *
 * For a given period P the offsets are:
 * - Ch0: 0         (0/4 of P)
 * - Ch1: P / 4     (quarter divisor)
 * - Ch2: P / 2     (half divisor)
 * - Ch3: 3 * P / 4 (three-quarter: multiply by 3, then divide by 4)
 *
 * @invariant All divisor values are >= 1, preventing division-by-zero in
 *            internal_calculate_phase_offset()
 *
 * @code{.c}
 * // Example: derive 90-degree offset for a period of 3000 counts
 * uint32_t offset_ch1 = 3000U / k_phase_divisor_quarter; // == 750
 * uint32_t offset_ch3 = (3000U * 3U) / k_phase_divisor_three_quarter; // == 2250
 * @endcode
 *
 * @see internal_calculate_phase_offset() Uses these divisors for GTCNT seeding
 * @see rx_gptw_init_all_staggered() Top-level staggered initialization function
 */
typedef enum : uint8_t {
  k_phase_divisor_none    = 1, /**< 0 deg: no offset (safe default, never causes div-by-zero) */
  k_phase_divisor_quarter = 4, /**< 90 deg = period/4 */
  k_phase_divisor_half    = 2, /**< 180 deg = period/2 */
  k_phase_divisor_three_quarter = 4, /**< 270 deg = 3*period/4 (multiplied by 3 then divided) */
} gptw_phase_divisor_t;

/**
 * @brief Calculate initial counter value and direction for phase staggering
 *
 * @details
 * Computes the initial counter value (GTCNT) and counting direction for a GPTW
 * channel to achieve the desired phase offset. Phase staggering spreads PWM edges
 * across the period to reduce peak current draw and EMI.
 *
 * ## Phase Offset Table (Sawtooth Mode)
 *
 * | Channel | Phase | Counter Init | Direction |
 * |---------|-------|--------------|-----------|
 * | Ch0 | 0deg | 0 | Up (n/a) |
 * | Ch1 | 90deg | period/4 | Up (n/a) |
 * | Ch2 | 180deg | period/2 | Up (n/a) |
 * | Ch3 | 270deg | 3xperiod/4 | Up (n/a) |
 *
 * ## Phase Offset Table (Triangle Mode)
 *
 * | Channel | Phase | Counter Init | Direction |
 * |---------|-------|--------------|-----------|
 * | Ch0 | 0deg | 0 | Up |
 * | Ch1 | 90deg | period/2 | Up |
 * | Ch2 | 180deg | period | Down |
 * | Ch3 | 270deg | period/2 | Down |
 *
 * @param[in] channel GPTW channel for phase calculation
 *   - Valid range: k_gptw_channel_0 to k_gptw_channel_3
 *   - Invalid values result in default outputs (0, true)
 * @param[in] period PWM period in counter counts
 *   - Must be > 0 to avoid division by zero
 *   - Zero period results in default outputs (0, true)
 * @param[in] is_triangle true for triangle (center-aligned), false for sawtooth
 * @param[out] init_count Pointer to store initial counter value
 *   - Must be non-NULL
 *   - Range: [0, period]
 * @param[out] init_dir_up Pointer to store initial count direction
 *   - Must be non-NULL
 *   - true = counting up, false = counting down
 *   - Only meaningful for triangle mode
 *
 * @pre Output pointers must be non-NULL
 * @pre period should be > 0 for valid calculations
 *
 * @post *init_count contains phase offset value
 * @post *init_dir_up contains initial direction (triangle mode)
 * @post Safe defaults (0, true) on any validation failure
 *
 * @note Returns void - validation failures produce safe defaults silently
 * @note For sawtooth mode, direction is ignored (always up)
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] nullptr checks, period validation
 * - Rule 2: [OK] No loops (direct calculation)
 *
 * @see internal_configure_channel_staggered() Calls this function
 * @see gptw_phase_divisor_t Divisor constants
 */
static void internal_calculate_phase_offset(const rx_gptw_channel_t channel,
                                            const uint32_t          period,
                                            const bool              is_triangle,
                                            uint32_t*               init_count,
                                            bool*                   init_dir_up)
{
  /* Pre-condition: validate output pointers (NASA Power of 10 Rule 5) */
  if (init_count == nullptr || init_dir_up == nullptr) {
    /* Cannot proceed without valid output pointers - caller error */
    return;
  }

  /* Pre-condition: validate period is non-zero to avoid division by zero */
  if (period == 0) {
    *init_count  = 0;
    *init_dir_up = true;
    return;
  }

  /* Pre-condition: validate channel is in valid range */
  if ((int32_t)channel >= (int32_t)k_gptw_max_channels) {
    *init_count  = 0;
    *init_dir_up = true;
    return;
  }

  *init_dir_up = true; /* Default to counting up */

  if (!is_triangle) {
    /* Edge-Aligned (Sawtooth) Staggering:
     * Ch0 (0 deg):   0
     * Ch1 (90 deg):  Period / 4
     * Ch2 (180 deg): Period / 2
     * Ch3 (270 deg): 3 * Period / 4
     */
    switch (channel) {
      case k_gptw_channel_0:
        *init_count = 0;
        break;
      case k_gptw_channel_1:
        *init_count = period / k_phase_divisor_quarter;
        break;
      case k_gptw_channel_2:
        *init_count = period / k_phase_divisor_half;
        break;
      case k_gptw_channel_3:
        *init_count = (period * 3) / k_phase_divisor_three_quarter;
        break;
      default:
        *init_count = 0;
        break;
    }
  } else {
    /* Center-Aligned (Triangle) Staggering:
     * Ch0 (0 deg):   0, Up
     * Ch1 (90 deg):  Period/2, Up
     * Ch2 (180 deg): Period, Down (Wait: Period is Top)
     *                Note: At Period, it turns around.
     *                For 180 shift, we want the "center" of the OFF pulse to correspond
     *                to the "center" of Ch0 ON pulse?
     *                Standard 3-phase shift logic applied to 4-phase:
     *                0 deg: 0 (Valley) -> Up
     *                90 deg: Period/2 -> Up
     *                180 deg: Period (Peak) -> Down (naturally acts as peak)
     *                270 deg: Period/2 -> Down
     */
    switch (channel) {
      case k_gptw_channel_0:
        *init_count  = 0;
        *init_dir_up = true;
        break;
      case k_gptw_channel_1:
        *init_count  = period / k_phase_divisor_half;
        *init_dir_up = true;
        break;
      case k_gptw_channel_2:
        *init_count  = period;
        *init_dir_up = false; /* Start at top, go down */
        break;
      case k_gptw_channel_3:
        *init_count  = period / k_phase_divisor_half;
        *init_dir_up = false; /* Start at mid, go down */
        break;
      default:
        *init_count = 0;
        break;
    }
  }
}

/**
 * @brief Configure a single GPTW channel for staggered PWM operation
 *
 * @details
 * Performs complete hardware configuration for one GPTW channel including
 * base timer setup, MPC pin function selection, port configuration, and
 * phase staggering initialization.
 *
 * ## Configuration Sequence
 *
 * 1. Validate channel range [0-3]
 * 2. Get channel register base address
 * 3. Configure base hardware (GTCR, GTIOR, GTPR, etc.)
 * 4. Configure MPC for Port E alternate function
 * 5. Configure port pins (PMR, PDR)
 * 6. Calculate phase offset for this channel
 * 7. Set initial counter value (GTCNT)
 * 8. For triangle mode: seed initial count direction
 * 9. Update initialization tracking state
 *
 * ## Phase Staggering
 *
 * Counter is initialized to a phase-offset value:
 * - Ch0: 0deg (reference, GTCNT=0)
 * - Ch1: 90deg (GTCNT=period/4)
 * - Ch2: 180deg (GTCNT=period/2)
 * - Ch3: 270deg (GTCNT=3xperiod/4)
 *
 * @param[in] channel GPTW channel to configure
 *   - Valid range: k_gptw_channel_0 to k_gptw_channel_3
 * @param[in] config Configuration parameters (frequency, deadtime, mode)
 *   - Must be non-NULL (caller's responsibility)
 * @param[in] period Pre-calculated period register value
 *   - Obtained from internal_calculate_period()
 * @param[in] is_triangle true if using triangle wave mode
 *   - Determines direction seeding requirement
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Channel configured successfully
 * @retval k_rx_err_invalid_arg Channel out of range or nullptr gptw base
 * @retval Others Propagated from internal_configure_gptw_hardware, internal_configure_mpc
 *
 * @pre Module clock enabled
 * @pre Timer stopped
 * @pre config pointer valid (caller validates)
 *
 * @post Channel fully configured with phase offset
 * @post s_gptw_initialized[channel] = true
 * @post s_gptw_period[channel] = period
 * @post Timer NOT started (caller starts all channels together)
 *
 * @note Not thread-safe: modifies hardware registers and shared state arrays
 *       (s_gptw_initialized, s_gptw_period); caller must ensure exclusive access
 * @note Timer is NOT started by this function
 * @note Called from rx_gptw_init_all_staggered() in a loop
 *
 * @par NASA Power of 10 Compliance:
 * - Rule 5: [OK] Channel range validation
 * - Rule 7: [OK] All internal function returns checked
 *
 * @see rx_gptw_init_all_staggered() Parent function
 * @see internal_calculate_phase_offset() Phase calculation
 */
static rx_err_t internal_configure_channel_staggered(const rx_gptw_channel_t channel,
                                                     const rx_gptw_config_t* config,
                                                     const uint32_t          period,
                                                     const bool              is_triangle)
{
  /* Pre-condition: validate channel range (NASA Power of 10 Rule 5) */
  if ((int32_t)channel >= (int32_t)k_gptw_max_channels) {
    return k_rx_err_invalid_arg;
  }

  volatile rx_gptw_channel_regs_t* gptw = internal_get_gptw_base(channel);

