Locked-Inc/STAR/star-rx72n-firmware/libs/rx_hal/src/rx_gptw.c
  /* Pre-condition: validate gptw pointer */
  if (gptw == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Base hardware configuration */
  rx_err_t err = internal_configure_gptw_hardware(gptw, config, period);
  if (err != k_rx_ok) {
    return err;
  }

  /* Configure MPC and Pins */
  err = internal_configure_mpc(channel);
  if (err != k_rx_ok) {
    return err;
  }
  internal_configure_port_pins(channel);

  /* Apply Phase Staggering */
  uint32_t init_count = 0;
  bool     dir_up     = true;

  internal_calculate_phase_offset(channel, period, is_triangle, &init_count, &dir_up);

  /* Modify counter value (unlocked by configure function, but we need to unlock again
   * since internal_configure_gptw_hardware locks it at the end)
   */
  gptw->gtwp  = k_gptw_gtwp_unlock;
  gptw->gtcnt = init_count;

  /* Handle Direction Seeding for Triangle Mode */
  if (is_triangle) {
    /* Use GTUDDTYC to force initial direction
     * UD (bit 0): 0=Down, 1=Up
     * UDF (bit 1): 1=Force
     * Sequence: Set Force -> Clear Force (latch direction)
     * Note: Manual verification confirmed UD=bit0, UDF=bit1.
     */
    uint32_t ud_val = dir_up ? k_gptw_gtuddtyc_ud : k_gptw_gtuddtyc_ud_down;

    /* Force direction */
    gptw->gtuddtyc = k_gptw_gtuddtyc_udf | ud_val;

    /* Clear force bit to allow normal counting operation */
    gptw->gtuddtyc = ud_val;
  }

  gptw->gtwp = k_gptw_gtwp_lock;

  /* Update internal state */
  s_gptw_period[channel]      = period;
  s_gptw_initialized[channel] = true;

  return k_rx_ok;
}

/**
 * @brief Initialize all 4 GPTW channels with 90-degree phase staggering
 *
 * @details
 * Implementation of rx_gptw_init_all_staggered() - see rx_gptw.h for complete
 * documentation with diagrams, examples, and NASA compliance notes.
 *
 * ## Implementation Overview
 *
 * 1. **Validate inputs**: NULL check, frequency > 0, valid wave_mode
 * 2. **Enable module clock**: Clear MSTPCRC.MSTPC10
 * 3. **Stop all channels**: Atomic stop via GTSTPA register
 * 4. **Calculate period**: Common period for all channels
 * 5. **Configure each channel**: Loop calls internal_configure_channel_staggered()
 * 6. **Start all channels**: Atomic start via GTSTRA register
 *
 * ## Phase Staggering Benefits
 *
 * - Reduces peak current by spreading PWM edges across period
 * - Lowers EMI from simultaneous switching transients
 * - Allows smaller power supply capacitors
 *
 * @param[in] config Pointer to common configuration for all channels
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All 4 channels initialized and running
 * @retval k_rx_err_null_ptr config is nullptr
 * @retval k_rx_err_invalid_arg Invalid frequency or wave_mode
 * @retval k_rx_err_hw_error GPTW common registers inaccessible
 *
 * @see rx_gptw.h Complete API documentation with diagrams and examples
 *
 * @callgraph
 */
rx_err_t rx_gptw_init_all_staggered(const rx_gptw_config_t* config)
{
  /* Pre-condition: validate config pointer (NASA Power of 10 Rule 5) */
  RX_CHECK_NULL_PTR(config, s_tag, "config pointer is nullptr");

  /* Pre-condition: validate frequency is non-zero */
  if (config->frequency_hz == 0) {
    rx_log_error(s_tag, "frequency_hz is zero");
    return k_rx_err_invalid_arg;
  }

  /* Pre-condition: validate wave_mode is within allowed values */
  switch (config->wave_mode) {
    case k_gptw_wave_saw_pwm:
    case k_gptw_wave_tri_pwm1:
    case k_gptw_wave_tri_pwm2:
    case k_gptw_wave_tri_pwm3:
      break;
    default:
      rx_log_error(s_tag, "Invalid wave_mode");
      return k_rx_err_invalid_arg;
  }

  rx_log_info(s_tag, "Initializing all GPTW channels (staggered)");

  /* Enable module clock (enables all channels) */
  internal_enable_gptw_module_clock();

  /* Stop all channels atomically to ensure clean config */
  if (gptw_common() != nullptr) {
    gptw_common()->gtstpa = k_gptw_all_channels_mask; /* Stop Ch0-3 */
  }

  /* Calculate period once (assumes same frequency for all) */
  uint32_t period;
  rx_err_t err = internal_calculate_period(config->frequency_hz, config->wave_mode, &period);
  if (err != k_rx_ok) {
    return err;
  }

  const bool is_triangle = internal_is_triangle_mode(config->wave_mode);

  /* Configure each channel using helper function */
  for (uint8_t i = 0; i < k_gptw_max_channels; i++) {
    rx_gptw_channel_t channel = (rx_gptw_channel_t)i;

    err = internal_configure_channel_staggered(channel, config, period, is_triangle);
    if (err != k_rx_ok) {
      return err;
    }
  }

  /* Start all channels atomically */
  if (gptw_common() != nullptr) {
    rx_log_info(s_tag, "Global start of GPTW channels");
    gptw_common()->gtstra = k_gptw_all_channels_mask; /* Start Ch0-3 */
  } else {
    return k_rx_err_hw_error;
  }

  return k_rx_ok;
}

/**
 * @brief Deinitialize a GPTW channel
 *
 * @details
 * Stops the timer, disables both PWM outputs (A and B), and resets
 * the counter to zero. Call only when motor control is no longer active.
 *
 * @param[in] channel GPTW channel (0-3)
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Success
 * @retval k_rx_err_invalid_arg Invalid channel number
 *
 * @pre Motor using this channel must be stopped before calling
 * @pre channel must be in range [k_gptw_channel_0, k_gptw_channel_3]
 *
 * @post Timer counter stopped (GTCR.CST = 0)
 * @post Both outputs disabled (GTIOR.OAE = 0, GTIOR.OBE = 0)
 * @post Counter register zeroed (GTCNT = k_gptw_period_zero)
 *
 * @invariant Write protection re-locked (GTWP) on all exit paths
 *
 * @note Not thread-safe: modifies hardware registers directly
 * @note Does not clear s_gptw_initialized[] or s_gptw_period[]
 *
 * @warning Ensure motor is at rest before calling to prevent abrupt stop
 *
 * @code{.c}
 * rx_err_t err = rx_gptw_deinit(k_gptw_channel_0);
 * @endcode
 *
 * @see rx_gptw_init_all() Re-initialize after deinit
 * @see rx_gptw_stop() Stop without full teardown
 *
 * @since Version 1.0.0
 */
rx_err_t rx_gptw_deinit(const rx_gptw_channel_t channel)
{
  if ((int32_t)channel >= (int32_t)k_gptw_max_channels) {
    return k_rx_err_invalid_arg;
  }

  volatile rx_gptw_channel_regs_t* gptw = internal_get_gptw_base(channel);
  if (gptw == nullptr) {
    return k_rx_err_invalid_arg;
  }

  /* Unlock write protection */
  gptw->gtwp = k_gptw_gtwp_unlock;

  /* Stop counter */
  gptw->gtcr &= ~k_gptw_gtcr_cst;

  /* Disable both outputs (OAE and OBE) */
  gptw->gtior &= ~(k_gptw_gtior_oae | k_gptw_gtior_obe);

  /* Reset counter to zero */
  gptw->gtcnt = k_gptw_period_zero;

  /* Re-lock write protection */
  gptw->gtwp = k_gptw_gtwp_lock;

  return k_rx_ok;
}

#endif /* __RX__ */
